Repository: openstack/keystone
Catalog: keystone/locale/*/LC_MESSAGES/keystone.po
Languages: tr_tr

source: %(event)s is not a valid notification event, must be one of: %(actions)s
tr_tr: %(event)s geçerli bir bilgilendirme olayı değil, şunlardan biri olmalı: %(actions)s

source: %(host)s is not a trusted dashboard host
tr_tr: %(host)s güvenilir bir gösterge paneli istemcisi değil

source: %(mod_name)s doesn't provide database migrations. The migration repository path at %(path)s doesn't exist or isn't a directory.
tr_tr: %(mod_name)s veri tabanı göçü sağlamıyor. %(path)s yolundaki göç deposu yolu mevcut değil ya da bir dizin değil.

source: %(property_name)s cannot be less than %(min_length)s characters.
tr_tr: %(property_name)s %(min_length)s karakterden az olamaz.

source: %(property_name)s is not a %(display_expected_type)s
tr_tr: %(property_name)s bir %(display_expected_type)s değil

source: %(property_name)s should not be greater than %(max_length)s characters.
tr_tr: %(property_name)s %(max_length)s karakterden büyük olmamalı.

source: %s cannot be empty.
tr_tr: %s boş olamaz.

source: %s field is required and cannot be empty
tr_tr: %s alanı gerekli ve boş olamaz

source: %s field(s) cannot be empty
tr_tr: %s alan(lar)ı boş olamaz

source: --all option cannot be mixed with other options
tr_tr: --all seçeneği diğer seçeneklerle birleştirilemez

source: A project-scoped token is required to produce a service catalog.
tr_tr: Servis kataloğu oluşturmak için proje-kapsamlı bir jeton gerekli.

source: Access token is expired
tr_tr: Erişim jetonunun süresi dolmuş

source: Access token not found
tr_tr: Erişim jetonu bulunamadı

source: Additional authentications steps required.
tr_tr: Ek kimlik doğrulama adımları gerekli.

source: An unexpected error occurred when retrieving domain configs
tr_tr: Alan yapılandırmaları alınırken beklenmedik hata oluştu

source: An unexpected error occurred when trying to store %s
tr_tr: %s depolanırken beklenmedik bir hata oluştu

source: An unexpected error prevented the server from fulfilling your request.
tr_tr: Beklenmedik bir hata sunucunun isteğinizi tamamlamasını engelledi.

source: At least one option must be provided
tr_tr: En az bir seçenek sağlanmalıdır

source: At least one option must be provided, use either --all or --domain-name
tr_tr: En az bir seçenek sağlanmalıdır, ya --all ya da --domain-name kullanın

source: Attempted to authenticate with an unsupported method.
tr_tr: Desteklenmeyen yöntem ile doğrulama girişiminde bulunuldu.

source: Authentication plugin error.
tr_tr: Kimlik doğrulama eklenti hatası.

source: Cannot authorize a request token with a token issued via delegation.
tr_tr: Vekil ile sağlanan bir jeton ile istek yetkilendirilemez.

source: Cannot change %(option_name)s %(attr)s
tr_tr: %(option_name)s %(attr)s değiştirilemiyor

source: Cannot change Domain ID
tr_tr: Alan ID'si değiştirilemez

source: Cannot change user ID
tr_tr: Kullanıcı ID'si değiştirilemiyor

source: Cannot change user name
tr_tr: Kullanıcı adı değiştirilemiyor

source: Cannot list request tokens with a token issued via delegation.
tr_tr: Vekalet ile sağlanan bir jeton ile istek jetonları listelenemez.

source: Cannot open certificate %(cert_file)s. Reason: %(reason)s
tr_tr: Sertifika %(cert_file)s açılamıyor. Sebep: %(reason)s

source: Cannot remove role that has not been granted, %s
tr_tr: Verilmemiş rol silinemez, %s

source: Cannot truncate a driver call without hints list as first parameter after self
tr_tr: self'den sonra ilk parametre olarak ipucu listesi verilmeden bir sürücü çağrısı kırpılamıyor

source: Cannot use parents_as_list and parents_as_ids query params at the same time.
tr_tr: parents_as_list ve parents_as_ids sorgu parametreleri aynı anda kullanılamaz.

source: Cannot use subtree_as_list and subtree_as_ids query params at the same time.
tr_tr: subtree_as_list ve subtree_as_ids sorgu parametreleri aynı anda kullanılamaz.

source: Combining effective and group filter will always result in an empty list.
tr_tr: Efektif ve grup filtresini birleştirmek her zaman boş bir listeye yol açar.

source: Combining effective, domain and inherited filters will always result in an empty list.
tr_tr: Efektif, alan ve miras filtrelerin birleştirilmesi her zaman boş bir listeye yol açar.

source: Conflicting region IDs specified: "%(url_id)s" != "%(ref_id)s"
tr_tr: Çatışan bölge kimlikleri belirtildi: "%(url_id)s" != "%(ref_id)s"

source: Consumer not found
tr_tr: Tüketici bulunamadı

source: Could not find Identity Provider identifier in environment
tr_tr: Kimlik Sağlayıcı tanımlayıcısı ortamda bulunamıyor

source: Could not validate the access token
tr_tr: Erişim jetonu doğrulanamadı

source: Disabling an entity where the 'enable' attribute is ignored by configuration.
tr_tr: 'enable' özniteliği yapılandırma tarafından göz ardı edilen bir öğe kapatılıyor.

source: Domain cannot be named %s
tr_tr: Alan %s olarak adlandırılamaz

source: Domain cannot have ID %s
tr_tr: Alan %s ID'sine sahip olamaz

source: Domain is disabled: %s
tr_tr: Alan kapalı: %s

source: Domain: %(domain)s already has a configuration defined - ignoring file: %(file)s.
tr_tr: Alan: %(domain)s zaten tanımlanmış bir yapılandırmaya sahip - dosya atlanıyor: %(file)s.

source: Duplicate ID, %s.
tr_tr: Kopya ID, %s

source: Duplicate name, %s.
tr_tr: Kopya isim, %s.

source: Endpoint %(endpoint_id)s not found in project %(project_id)s
tr_tr: Bitiş noktası %(endpoint_id)s %(project_id)s projesinde bulunamadı

source: Endpoint Group Project Association not found
tr_tr: Bitiş Noktası Grup Proje İlişkisi bulunamadı

source: Ensure configuration option idp_entity_id is set.
tr_tr: idp_entity_id yapılandırma seçeneğinin ayarlandığına emin olun.

source: Ensure configuration option idp_sso_endpoint is set.
tr_tr: idp_sso_endpoint yapılandırma seçeneğinin ayarlandığına emin olun.

source: Error parsing configuration file for domain: %(domain)s, file: %(file)s.
tr_tr: Alan: %(domain)s için yapılandırma dosyası ayrıştırılırken hata, dosya: %(file)s.

source: Error while opening file %(path)s: %(err)s
tr_tr: Dosya açılırken hata %(path)s: %(err)s

source: Error while parsing rules %(path)s: %(err)s
tr_tr: Kurallar ayrıştırılırken hata %(path)s: %(err)s

source: Expected dict or list: %s
tr_tr: Sözlük ya da liste beklendi: %s

source: Expected signing certificates are not available on the server. Please check Keystone configuration.
tr_tr: Beklenen imzalama sertifikaları sunucuda kullanılabilir değil. Lütfen Keystone yapılandırmasını kontrol edin.

source: Failed to validate token
tr_tr: Jeton doğrulama başarısız

source: Federation token is expired
tr_tr: Federasyon jetonunun süresi dolmuş

source: Field "remaining_uses" is set to %(value)s while it must not be set in order to redelegate a trust
tr_tr: "remaining_uses" alanı %(value)s olarak ayarlanmış, bir güvene tekrar yetki vermek için böyle ayarlanmamalı

source: Group %(group)s is not supported for domain specific configurations
tr_tr: %(group)s grubu alana özel yapılandırmalar için desteklenmiyor

source: Group %(group_id)s returned by mapping %(mapping_id)s was not found in the backend.
tr_tr: %(mapping_id)s eşleştirmesi tarafından döndürülen %(group_id)s grubu arka uçta bulunamadı.

source: ID attribute %(id_attr)s not found in LDAP object %(dn)s
tr_tr: ID özniteliği %(id_attr)s %(dn)s LDAP nesnesinde bulunamadı

source: Identity Provider %(idp)s is disabled
tr_tr: Kimlik Sağlayıcı %(idp)s kapalı

source: Incoming identity provider identifier not included among the accepted identifiers.
tr_tr: Gelen kimlik sağlayıcı tanımlayıcısı kabul edilen tanımlayıcılar arasında yok.

source: Invalid LDAP TLS certs option: %(option)s. Choose one of: %(options)s
tr_tr: Geçersiz LDAP TLS sertifika seçeneği: %(option)s. Şunlardan birini seçin: %(options)s

source: Invalid LDAP TLS_AVAIL option: %s. TLS not available
tr_tr: Geçersiz LDAP TLS_AVAIL seçeneği: %s. TLS kullanılabilir değil

source: Invalid LDAP deref option: %(option)s. Choose one of: %(options)s
tr_tr: Geçersiz LDAP referans kaldırma seçeneği: %(option)s. Şunlardan birini seçin: %(options)s

source: Invalid LDAP scope: %(scope)s. Choose one of: %(options)s
tr_tr: Geçersiz LDAP kapsamı: %(scope)s. Şunlardan birini seçin: %(options)s

source: Invalid TLS / LDAPS combination
tr_tr: Geçersiz TLS / LDAPS kombinasyonu

source: Invalid blob in credential
tr_tr: Kimlik bilgisinde geçersiz düğüm

source: Invalid domain name: %(domain)s found in config file name: %(file)s - ignoring this file.
tr_tr: Yapılandırma dosyası isminde: %(file)s geçersiz alan adı: %(domain)s bulundu - bu dosya atlanıyor.

source: Invalid rule: %(identity_value)s. Both 'groups' and 'domain' keywords must be specified.
tr_tr: Geçersiz kural: %(identity_value)s. Hem 'gruplar' hem 'alan' anahtar kelimeleri belirtilmeli.

source: Invalid signature
tr_tr: Geçersiz imza

source: Invalid user / password
tr_tr: Geçersiz kullanıcı / parola

source: Invalid username or password
tr_tr: Geçersiz kullanıcı adı ve parola

source: Malformed endpoint URL (%(endpoint)s), see ERROR log for details.
tr_tr: Kusurlu bitiş noktası URL'si (%(endpoint)s), detaylar için HATA kaydına bakın.

source: Member %(member)s is already a member of group %(group)s
tr_tr: Üye %(member)s zaten %(group)s grubunun üyesi

source: Method not callable: %s
tr_tr: Metod çağrılabilir değil: %s

source: Missing entity ID from environment
tr_tr: Öğe kimliği ortamdan eksik

source: Modifying "redelegation_count" upon redelegation is forbidden. Omitting this parameter is advised.
tr_tr: Tekrar yetkilendirme üzerine "redelegation_count" değiştirmeye izin verilmez. Tavsiye edildiği gibi bu parametre atlanıyor.

source: Multiple domains are not supported
tr_tr: Birden çok alan desteklenmiyor

source: Must specify either domain or project
tr_tr: Alan ya da projeden biri belirtilmelidir

source: No authenticated user
tr_tr: Kimlik denetimi yapılmamış kullanıcı

source: No encryption keys found; run keystone-manage fernet_setup to bootstrap one.
tr_tr: Şifreleme anahtarları bulundu; birini yükletmek için keystone-manage fernet_setup çalıştırın.

source: No options specified
tr_tr: Hiçbir seçenek belirtilmedi

source: No policy is associated with endpoint %(endpoint_id)s.
tr_tr: Hiçbir ilke %(endpoint_id)s bitiş noktasıyla ilişkilendirilmemiş.

source: One of the trust agents is disabled or deleted
tr_tr: Güven ajanlarından biri kapalı ya da silinmiş

source: Option %(option)s found with no group specified while checking domain configuration request
tr_tr: %(option)s seçeneği alan yapılandırma isteği kontrol edilirken hiçbir grup belirtilmemiş şekilde bulundu

source: Option %(option)s in group %(group)s is not supported for domain specific configurations
tr_tr: %(group)s grubundaki %(option)s seçeneği alana özel yapılandırmalarda desteklenmiyor

source: Project field is required and cannot be empty.
tr_tr: Proje alanı gerekli ve boş olamaz.

source: Project is disabled: %s
tr_tr: Proje kapalı: %s

source: Redelegation allowed for delegated by trust only
tr_tr: Tekrar yetki vermeye yalnızca güven tarafından yetki verilenler için izin verilir

source: Remaining redelegation depth of %(redelegation_depth)d out of allowed range of [0..%(max_count)d]
tr_tr: izin verilen [0..%(max_count)d] aralığı içinden %(redelegation_depth)d izin verilen tekrar yetki verme derinliği

source: Request must have an origin query parameter
tr_tr: İstek bir başlangıç noktası sorgu parametresine sahip olmalı

source: Request token is expired
tr_tr: İstek jetonunun süresi dolmuş

source: Request token not found
tr_tr: İstek jetonu bulunamadı

source: Requested expiration time is more than redelegated trust can provide
tr_tr: İstenen zaman bitim süresi tekrar yetkilendirilen güvenin sağlayabileceğinden fazla

source: Requested redelegation depth of %(requested_count)d is greater than allowed %(max_count)d
tr_tr: %(requested_count)d istenen tekrar yetki verme derinliği izin verilen %(max_count)d den fazla

source: Scoping to both domain and project is not allowed
tr_tr: Hem alan hem projeye kapsamlamaya izin verilmez

source: Scoping to both domain and trust is not allowed
tr_tr: Hem alan hem güvene kapsamlamaya izin verilmez

source: Scoping to both project and trust is not allowed
tr_tr: Hem proje hem güvene kapsamlamaya izin verilmez

source: Service Provider %(sp)s is disabled
tr_tr: Servis Sağlayıcı %(sp)s kapalı

source: Some of requested roles are not in redelegated trust
tr_tr: İstenen rollerin bazıları tekrar yetki verilen güven içinde değil

source: Specify a domain or project, not both
tr_tr: Bir alan ya da proje belirtin, ya da her ikisini

source: Specify a user or group, not both
tr_tr: Bir kullanıcı ya da grup belirtin, ikisini birden değil

source: Specify one of domain or project
tr_tr: Alandan ya da projeden birini belirtin

source: Specify one of user or group
tr_tr: Kullanıcı ya da grup belirtin

source: The 'expires_at' must not be before now. The server could not comply with the request since it is either malformed or otherwise incorrect. The client is assumed to be in error.
tr_tr: 'expires_at' şu andan önce olmamalı. Sunucu talebi yerine getiremedi çünkü istek ya kusurlu ya da geçersiz. İstemcinin hata durumunda olduğu varsayılıyor.

source: The --all option cannot be used with the --domain-name option
tr_tr: --all seçeneği --domain-name seçeneğiyle kullanılamaz

source: The Keystone configuration file %(config_file)s could not be found.
tr_tr: Keystone yapılandırma dosyası %(config_file)s bulunamadı.

source: The Keystone domain-specific configuration has specified more than one SQL driver (only one is permitted): %(source)s.
tr_tr: Keystone alana özel yapılandırması birden fazla SQL sürücüsü belirtti (yalnızca birine izin verilir): %(source)s.

source: The action you have requested has not been implemented.
tr_tr: İstediğiniz eylem uygulanmamış.

source: The password length must be less than or equal to %(size)i. The server could not comply with the request because the password is invalid.
tr_tr: Parola uzunluğu %(size)i ye eşit ya da daha küçük olmalı. Sunucu talebe cevap veremedi çünkü parola geçersiz.

source: The request you have made requires authentication.
tr_tr: Yaptığınız istek kimlik doğrulama gerektiriyor.

source: The revoke call must not have both domain_id and project_id. This is a bug in the Keystone server. The current request is aborted.
tr_tr: İptal etme çağrısı hem domain_id hem project_id'ye sahip olmamalı. Bu Keystone sunucudaki bir hata. Mevcut istek iptal edildi.

source: The service you have requested is no longer available on this server.
tr_tr: İstediğiniz servis artık bu sunucu üzerinde kullanılabilir değil.

source: The specified parent region %(parent_region_id)s would create a circular region hierarchy.
tr_tr: Belirtilen üst bölge %(parent_region_id)s dairesel bölge sıralı dizisi oluştururdu.

source: The value of group %(group)s specified in the config should be a dictionary of options
tr_tr: Yapılandırmada belirtilen %(group)s grubunun değeri seçenekler sözlüğü olmalı

source: This is not a recognized Fernet payload version: %s
tr_tr: Bu bilinen bir Fernet faydalı yük sürümü değil: %s

source: Timestamp not in expected format. The server could not comply with the request since it is either malformed or otherwise incorrect. The client is assumed to be in error.
tr_tr: Zaman damgası beklenen biçimde değil. Sunucu talebi yerine getiremedi çünkü istek ya kusurlu ya da geçersiz. İstemcinin hata durumunda olduğu varsayılıyor.

source: Trustee has no delegated roles.
tr_tr: Yedieminin emanet edilen kuralları yok.

source: Trustor is disabled.
tr_tr: Güven kurucu kapalı.

source: Trying to update group %(group)s, so that, and only that, group must be specified in the config
tr_tr: %(group)s grubu güncellenmeye çalışılıyor, böylece yapılandırmada yalnızca grup belirtilmeli

source: Trying to update option %(option)s in group %(group)s, but config provided contains option %(option_other)s instead
tr_tr: %(group)s grubundaki %(option)s seçeneği güncellenmeye çalışılıyor, ama sağlanan yapılandırma %(option_other)s seçeneğini içeriyor

source: Trying to update option %(option)s in group %(group)s, so that, and only that, option must be specified in the config
tr_tr: %(group)s grubundaki %(option)s seçeneği güncellenmeye çalışıldı, böylece, yapılandırmada yalnızca bu seçenek belirtilmeli

source: Unable to access the keystone database, please check it is configured correctly.
tr_tr: Keystone veri tabanına erişilemiyor, lütfen doğru yapılandırıldığından emin olun.

source: Unable to delete region %(region_id)s because it or its child regions have associated endpoints.
tr_tr: Bölge %(region_id)s silinemedi çünkü kendisi ya da alt bölgelerinin ilişkilendirilmiş bitiş noktaları var.

source: Unable to locate domain config directory: %s
tr_tr: Alan yapılandırma dizini bulunamıyor: %s

source: Unable to lookup user %s
tr_tr: %s kullanıcısı aranamadı

source: Unable to reconcile identity attribute %(attribute)s as it has conflicting values %(new)s and %(old)s
tr_tr: Kimlik özniteliği %(attribute)s bağdaştırılamıyor çünkü çatışan değerleri var %(new)s ve %(old)s

source: Unexpected assignment type encountered, %s
tr_tr: Beklenmedik atama türüyle karşılaşıldı, %s

source: Unexpected status requested for JSON Home response, %s
tr_tr: JSON Home yanıtı için beklenmedik durum istendi, %s

source: Unknown domain '%(name)s' specified by --domain-name
tr_tr: --domain-name ile bilinmeyen alan '%(name)s' belirtilmiş

source: Unregistered dependency: %(name)s for %(targets)s
tr_tr: Kaydı silinmiş bağımlılık: %(targets)s için %(name)s

source: Update of `parent_id` is not allowed.
tr_tr: `parent_id` güncellemesine izin verilmiyor.

source: Use a project scoped token when attempting to create a SAML assertion
tr_tr: SAML iddiası oluşturma girişimi sırasında proje kapsamlı bir jeton kullan

source: User %(user_id)s has no access to domain %(domain_id)s
tr_tr: %(user_id)s kullanıcısının %(domain_id)s alanına erişimi yok

source: User %(user_id)s has no access to project %(project_id)s
tr_tr: %(user_id)s kullanıcısının %(project_id)s projesine erişimi yok

source: User %(user_id)s is already a member of group %(group_id)s
tr_tr: Kullanıcı %(user_id)s zaten %(group_id)s grubu üyesi

source: User '%(user_id)s' not found in group '%(group_id)s'
tr_tr: Kullanıcı '%(user_id)s' '%(group_id)s' grubunda bulunamadı

source: User IDs do not match
tr_tr: Kullanıcı ID leri uyuşmuyor

source: User is disabled: %s
tr_tr: Kullanıcı kapalı: %s

source: User is not a trustee.
tr_tr: Kullanıcı güvenilir değil.

source: User type %s not supported
tr_tr: Kullanıcı türü %s desteklenmiyor

source: You are not authorized to perform the requested action.
tr_tr: İstenen eylemi gerçekleştirmek için yetkili değilsiniz.

source: any options
tr_tr: herhangi bir seçenek

source: auth_type is not Negotiate
tr_tr: auth_type Negotiate değil

source: authorizing user does not have role required
tr_tr: yetkilendiren kullanıcı gerekli role sahip değil

source: cannot create a project in a branch containing a disabled project: %s
tr_tr: kapalı bir proje içeren bir alt grupta proje oluşturulamaz: %s

source: group %(group)s
tr_tr: grup %(group)s

source: option %(option)s in group %(group)s
tr_tr: %(group)s grubundaki %(option)s seçeneği

source: remaining_uses must be a positive integer or null.
tr_tr: remaining_uses pozitif bir değer ya da null olmalı.

source: remaining_uses must not be set if redelegation is allowed
tr_tr: tekrar yetkilendirmeye izin veriliyorsa remaining_uses ayarlanmamalı

source: request to update group %(group)s, but config provided contains group %(group_other)s instead
tr_tr: %(group)s grubunu güncelleme isteği, ama sağlanan yapılandırma %(group_other)s grubunu içeriyor

source: rescope a scoped token
tr_tr: kapsamlı bir jeton tekrar kapsamlandı

source: tls_cacertdir %s not found or is not a directory
tr_tr: tls_cacertdir %s bulunamadı ya da bir dizin

source: tls_cacertfile %s not found or is not a file
tr_tr: tls_cacertfile %s bulunamadı ya da bir dosya değil
