Repository: openstack/keystone
Catalog: keystone/locale/*/LC_MESSAGES/keystone-log-warning.po
Languages: tr_tr

source: %s is not a dogpile.proxy.ProxyBackend
tr_tr: %s dogpile.proxy.ProxyBackend değil

source: Authorization failed. %(exception)s from %(remote_addr)s
tr_tr: Yetkilendirme başarısız. %(remote_addr)s den %(exception)s

source: Endpoint %(endpoint_id)s referenced in association for policy %(policy_id)s not found.
tr_tr: %(policy_id)s ile ilişkisi için başvurulan bitiş noktası %(endpoint_id)s bulunamadı.

source: Failed to invoke ``openssl version``, assuming is v1.0 or newer
tr_tr: ``openssl version`` çalıştırılamadı, v1.0 ya da daha yeni olarak varsayılıyor

source: Found multiple domains being mapped to a driver that does not support that (e.g. LDAP) - Domain ID: %(domain)s, Default Driver: %(driver)s
tr_tr: Bunu desteklemeyen bir sürücüye eşleştirilen birden fazla alan bulundu (örn. LDAP) - Alan ID: %(domain)s, Varsayılan Sürücü: %(driver)s

source: Found what looks like an incorrectly constructed config option substitution reference - domain: %(domain)s, group: %(group)s, option: %(option)s, value: %(value)s.
tr_tr: Düzgün inşa edilmemiş yapılandırma seçeneği yer değiştirme referansına benzeyen bir şey bulundu - alan: %(domain)s, grup: %(group)s, seçenek: %(option)s, değer: %(value)s.

source: Found what looks like an unmatched config option substitution reference - domain: %(domain)s, group: %(group)s, option: %(option)s, value: %(value)s. Perhaps the config option to which it refers has yet to be added?
tr_tr: Eşleşmemiş yapılandırma seçeneği yer değiştirme referansı gibi görünen bir şey bulundu - alan: %(domain)s, grup: %(group)s, seçenek: %(option)s, değer: %(value)s. Belki başvurduğu yapılandırma seçeneği henüz eklenmemiştir?

source: Ignoring file (%s) while scanning domain config directory
tr_tr: Alan yapılandırma dizini taranırken dosya (%s) atlanıyor

source: Ignoring user name
tr_tr: Kullanıcı adı atlanıyor

source: Invalid additional attribute mapping: "%s". Format must be <ldap_attribute>:<keystone_attribute>
tr_tr: Geçersiz ek öznitelik eşleştirmesi: "%s". Biçim <ldap_attribute>:<keystone_attribute> olmalı

source: Invalid domain name (%s) found in config file name
tr_tr: Yapılandırma dosyası isminde geçersiz alan adı (%s) bulundu

source: It is recommended to only use the base key-value-store implementation for the token driver for testing purposes. Please use 'memcache' or 'sql' instead.
tr_tr: Jeton sürücüsü için temel anahtar-değer-depolama uygulamasının yalnızca test amaçlı kullanımı önerilir. Lütfen 'memcache' ya da 'sql' kullanın.

source: KVS lock released (timeout reached) for: %s
tr_tr: KVS kilidi kaldırıldı (zaman aşımına uğradı): %s

source: LDAP Server does not support paging. Disable paging in keystone.conf to avoid this message.
tr_tr: LDAP Sunucu sayfalamayı desteklemiyor. Bu iletiyi almamak için sayfalamayı keystone.conf'da kapatın.

source: No domain information specified as part of list request
tr_tr: Listeleme isteğinin parçası olarak alan bilgisi belirtilmedi

source: Policy %(policy_id)s referenced in association for endpoint %(endpoint_id)s not found.
tr_tr: %(endpoint_id)s bitiş noktası için ilişkisi için başvurulan %(policy_id)s ilkesi bulunamadı.

source: RBAC: Bypassing authorization
tr_tr: RBAC: Yetkilendirme baypas ediliyor

source: RBAC: Invalid user data in token
tr_tr: RBAC: Jetonda geçersiz kullanıcı verisi

source: Removing `%s` from revocation list due to invalid expires data in revocation list.
tr_tr: feshetme listesindeki geçersiz sona erme tarihi verisi sebebiyle `%s` feshetme listesinden kaldırılıyor.

source: Token `%s` is expired, not adding to the revocation list.
tr_tr: `%s` jetonunun süresi dolmuş, feshetme listesine eklenmiyor.

source: Truncating user password to %d characters.
tr_tr: Kullanıcı parolası %d karaktere kırpılıyor.

source: Unable to add user %(user)s to %(tenant)s.
tr_tr: Kullanıcı %(user)s %(tenant)s'e eklenemiyor.

source: Unable to change the ownership of the new key without a keystone user ID and keystone group ID both being provided: %s
tr_tr: Hem keystone kullanıcı kimliği hem keystone grup kimliği verilmeden yeni anahtarın sahipliği değiştirilemiyor: %s

source: Unable to locate domain config directory: %s
tr_tr: Alan yapılandırma dizini bulunamadı: %s

source: Unable to remove user %(user)s from %(tenant)s.
tr_tr: Kullanıcı %(user)s %(tenant)s'den çıkarılamadı.

source: Unsupported policy association found - Policy %(policy_id)s, Endpoint %(endpoint_id)s, Service %(service_id)s, Region %(region_id)s,
tr_tr: Desteklenmeyen ilke ilişkilendirmesi bulundu - İlke %(policy_id)s, Bitiş noktası %(endpoint_id)s, Servis %(service_id)s, Bölge %(region_id)s,

source: User %(user_id)s doesn't have access to default project %(project_id)s. The token will be unscoped rather than scoped to the project.
tr_tr: %(user_id)s kullanıcısı varsayılan proje %(project_id)s erişimine sahip değil. Jeton projeye kapsamsız olacak, kapsamlı değil.

source: User %(user_id)s's default project %(project_id)s is disabled. The token will be unscoped rather than scoped to the project.
tr_tr: %(user_id)s kullanıcısının varsayılan projesi %(project_id)s kapalı. Jeton projeye kapsamsız olacak, kapsamlı değil.

source: User %(user_id)s's default project %(project_id)s not found. The token will be unscoped rather than scoped to the project.
tr_tr: %(user_id)s kullanıcısının varsayılan projesi %(project_id)s bulunamadı. Jeton projeye kapsamsız olacak, kapsamlı değil.

source: When deleting entries for %(search_base)s, could not delete nonexistent entries %(entries)s%(dots)s
tr_tr: %(search_base)s için girdiler silinirken, mevcut olmayan girdiler %(entries)s%(dots)s silinemedi

source: `token_api.%s` is deprecated as of Juno in favor of utilizing methods on `token_provider_api` and may be removed in Kilo.
tr_tr: `token_provider_api` üzerindeki yöntemlerden faydalanmak için `token_api.%s` Juno'dan sonra tercih edilmeyecek ve Kilo'da kaldırılabilir.

source: keystone-manage pki_setup is not recommended for production use.
tr_tr: keystone-manage pki_setup üretimde kullanmak için tavsiye edilmez.

source: missing exception kwargs (programmer error)
tr_tr: istisna kwargs eksik (programcı hatası)
